## Repetisjon av pandas
### Les inn data
Les data fra csv-fil

In [4]:
import pandas as pd
df = pd.read_csv('b_3_8_1_data.csv', sep=';')
display(df.head())

   Navn  Alder  Høyde  Vekt
0   Ola     27    180    75
1  Kari     30    170    60
2   Per     27    185    80
3  Lise     28    165    55

Les data fra json-fil

In [5]:
df = pd.read_json('b_3_8_1_data.json')
display(df.head())

   Navn  Alder  Høyde  Vekt
0   Ola     27    180    75
1  Kari     30    170    60
2   Per     27    185    80
3  Lise     28    165    55

### Info om datasettet

In [6]:
print(df.info())
print(df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Navn    4 non-null      object
 1   Alder   4 non-null      int64
 2   Høyde   4 non-null      int64
 3   Vekt    4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes
None
           Alder       Høyde       Vekt
count   4.000000    4.000000   4.000000
mean   28.000000  175.000000  67.500000
std     1.414214    9.128709  11.902381
min    27.000000  165.000000  55.000000
25%    27.000000  168.750000  58.750000
50%    27.500000  175.000000  67.500000
75%    28.500000  181.250000  76.250000
max    30.000000  185.000000  80.000000

### Velge ut bestemte kolonner, rader og celler
Hent ut en kolonne som DataFrame

In [7]:
kolonne = df[['Navn']]
print('\ntype:\n', type(kolonne))
display(kolonne)

type:
 <class 'pandas.core.frame.DataFrame'>

   Navn
0   Ola
1  Kari
2   Per
3  Lise

Hent ut en kolonne som Series

In [8]:
serie = df['Alder']
print('\ntype:\n', type(serie))
display(serie)

type:
 <class 'pandas.core.series.Series'>

0    27
1    30
2    27
3    28
Name: Alder, dtype: int64

Hent ut en kolonne som list

In [9]:
liste = df['Høyde'].tolist()
print('\ntype:\n', type(liste))
display(liste)

type:
 <class 'list'>

[180, 170, 185, 165]

Hent ut en rad som DataFrame

In [10]:
rad = df.iloc[[0]]
print('\ntype:\n', type(rad))
display(rad)

type:
 <class 'pandas.core.frame.DataFrame'>

  Navn  Alder  Høyde  Vekt
0  Ola     27    180    75

Hent ut en rad som Series

In [11]:
serie = df.iloc[1]
print('\ntype:\n', type(serie))
display(serie)

type:
 <class 'pandas.core.series.Series'>

Navn     Kari
Alder      30
Høyde     170
Vekt       60
Name: 1, dtype: object

Hent ut en rad som list

In [12]:
liste = df.iloc[2].tolist()
print('\ntype:\n', type(liste))
display(liste)

type:
 <class 'list'>

['Per', 27, 185, 80]

Velge ut celler *(slices)* med indeks

In [13]:
# Vi kan også bruke : for å velge alle rader eller kolonner
# eller f.eks. stykke = df.iloc[1:3, [0,2]] for å velge radene 1 og 2
stykke = df.iloc[[1,2], [0,2]]
display(stykke)
print(stykke.info())

   Navn  Høyde
1  Kari    170
2   Per    185

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Navn    2 non-null      object
 1   Høyde   2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 48.0+ bytes
None

Velge ut celler *(slices)* med navn

In [14]:
# Her har ikke radene navn, men de kan ha det
stykke = df.loc[[0,3], ["Navn", "Alder"]]
display(stykke)
print(stykke.info())

   Navn  Alder
0   Ola     27
3  Lise     28

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Navn    2 non-null      object
 1   Alder   2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 48.0+ bytes
None

### Legge til og fjerne kolonner og rader
Legg til en ny rad

In [15]:
df['BMI'] = df['Vekt']/((df['Høyde']/100)**2)
display(df.head())

   Navn  Alder  Høyde  Vekt        BMI
0   Ola     27    180    75  23.148148
1  Kari     30    170    60  20.761246
2   Per     27    185    80  23.374726
3  Lise     28    165    55  20.202020

Fjerne en kolonne

In [16]:
df = df.drop('BMI', axis=1)
display(df.head())

   Navn  Alder  Høyde  Vekt
0   Ola     27    180    75
1  Kari     30    170    60
2   Per     27    185    80
3  Lise     28    165    55

Legge til en ny rad

In [17]:
ny_rad = pd.DataFrame([['Knut', 27, 190, 90]], columns=['Navn', 'Alder', 'Høyde', 'Vekt'])
df = pd.concat([df, ny_rad])
display(df.tail())
df = df.reset_index(drop=True)
display(df.tail())

   Navn  Alder  Høyde  Vekt
0   Ola     27    180    75
1  Kari     30    170    60
2   Per     27    185    80
3  Lise     28    165    55
0  Knut     27    190    90

   Navn  Alder  Høyde  Vekt
0   Ola     27    180    75
1  Kari     30    170    60
2   Per     27    185    80
3  Lise     28    165    55
4  Knut     27    190    90

Slett en rad

In [18]:
df = df.drop(2)
df = df.reset_index(drop=True)
display(df.tail())

   Navn  Alder  Høyde  Vekt
0   Ola     27    180    75
1  Kari     30    170    60
2  Lise     28    165    55
3  Knut     27    190    90

### Sortering, gruppering og funksjoner
Sorter etter navn i stigende rekkefølge *(inplace)*

In [19]:
df.sort_values(by='Navn', ascending=True, inplace=True)
display(df)

   Navn  Alder  Høyde  Vekt
1  Kari     30    170    60
3  Knut     27    190    90
2  Lise     28    165    55
0   Ola     27    180    75

Sorter eller alder i synkende rekkefølge (opprett ny DataFrame)

In [20]:
df = df.sort_values(by='Alder', ascending=False)
display(df)

   Navn  Alder  Høyde  Vekt
1  Kari     30    170    60
2  Lise     28    165    55
3  Knut     27    190    90
0   Ola     27    180    75

Gruppere etter alder og beregne gjennomsnittlig høyde og vekt for hver gruppe

In [21]:
gruppert_df = df.groupby('Alder').agg({'Høyde': 'mean', 'Vekt': 'mean'})
display(gruppert_df)

       Høyde  Vekt
Alder
27     185.0  82.5
28     165.0  55.0
30     170.0  60.0

Beregne gjennomsnittlig alder, max høyde og min vekt for hele datasettet

In [22]:
mean_alder = df['Alder'].mean()
max_hoyde = df['Høyde'].max()
min_vekt = df['Vekt'].min()
print(f'Gjennomsnittlig alder: {mean_alder}, Max høyde: {max_hoyde}, Min vekt: {min_vekt}')

Gjennomsnittlig alder: 28.0, Max høyde: 190, Min vekt: 55

In [26]:
# Finne den eldste personen i datasettet
print(f'Den eldste personen i datasettet er {df["Alder"].max()} år gammel')
eldst = df.loc[df['Alder'] == df['Alder'].max(), 'Navn'].values[0]
print(f'Den eldste personen i datasettet er {eldst}')

Den eldste personen i datasettet er 30 år gammel
Den eldste personen i datasettet er Kari

Smidig IT-2 © TIP AS, 2024